{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"kernel_constraint": null, "trainable": true, "padding": "same", "use_bias": true, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3], "kernel_regularizer": null, "name": "conv1d_1", "bias_constraint": null, "activation": "linear", "batch_input_shape": [null, 399, 26], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "dilation_rate": [1], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"trainable": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling1d_1", "strides": [2], "pool_size": [2], "data_format": "channels_last"}, "class_name": "MaxPooling1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "padding": "same", "use_bias": true, "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3], "kernel_regularizer": null, "name": "conv1d_2", "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"trainable": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling1d_2", "strides": [4], "pool_size": [4], "data_format": "channels_last"}, "class_name": "MaxPooling1D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "padding": "same", "use_bias": true, "filters": 128, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3], "kernel_regularizer": null, "name": "conv1d_3", "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "strides": [1]}, "class_name": "Conv1D"}, {"config": {"trainable": true, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling1d_3", "strides": [4], "pool_size": [4], "data_format": "channels_last"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1024, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 3, "activation": "softmax", "name": "dense_2"}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}